
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7697992939)



<pre><code>Apply complete! Resources: 1 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/b2bbce40-d463-43b5-b5f8-db2205fcb6a3/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_compute_network.internal-vpc-network: Refreshing state... [id=projects/gig-japan-398904/global/networks/int-vpc]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]
google_project_service.network_apis["vpcaccess.googleapis.com"]: Refreshing state... [id=gig-japan-398904/vpcaccess.googleapis.com]
google_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_vpc_access_connector.internal-vpc-connector will be created
  + resource "google_vpc_access_connector" "internal-vpc-connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.5.5.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = 4
      + max_throughput     = 500
      + min_instances      = 2
      + min_throughput     = 200
      + name               = "vpc-connector"
      + network            = "projects/gig-japan-398904/global/networks/int-vpc"
      + project            = "gig-japan-398904"
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
google_vpc_access_connector.internal-vpc-connector: Creating...
google_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_vpc_access_connector.internal-vpc-connector: Still creating... [10s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [20s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [30s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [40s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [50s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [1m0s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [1m10s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [1m20s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [1m30s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [1m40s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [1m50s elapsed]
google_vpc_access_connector.internal-vpc-connector: Still creating... [2m0s elapsed]
google_vpc_access_connector.internal-vpc-connector: Creation complete after 2m9s [id=projects/gig-japan-398904/locations/asia-northeast1/connectors/vpc-connector]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_compute_network.internal-vpc-network: Refreshing state... [id=projects/gig-japan-398904/global/networks/int-vpc]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_project_service.network_apis["vpcaccess.googleapis.com"]: Refreshing state... [id=gig-japan-398904/vpcaccess.googleapis.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource "google_artifact_registry_repository" "artifact-repository" {%0A        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"%0A        name             = "ikigai"%0A        # (10 unchanged attributes hidden)%0A%0A      + docker_config {%0A          + immutable_tags = false%0A        }%0A    }%0A%0A  # google_vpc_access_connector.internal-vpc-connector will be created%0A  + resource "google_vpc_access_connector" "internal-vpc-connector" {%0A      + connected_projects = (known after apply)%0A      + id                 = (known after apply)%0A      + ip_cidr_range      = "10.5.5.0/28"%0A      + machine_type       = "e2-micro"%0A      + max_instances      = 4%0A      + max_throughput     = 500%0A      + min_instances      = 2%0A      + min_throughput     = 200%0A      + name               = "vpc-connector"%0A      + network            = "projects/gig-japan-398904/global/networks/int-vpc"%0A      + project            = "gig-japan-398904"%0A      + region             = "asia-northeast1"%0A      + self_link          = (known after apply)%0A      + state              = (known after apply)%0A    }%0A%0APlan: 1 to add, 1 to change, 0 to destroy.%0Agoogle_vpc_access_connector.internal-vpc-connector: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [10s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [20s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [30s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [40s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [50s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [1m0s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [1m10s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [1m20s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [1m30s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [1m40s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [1m50s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Still creating... [2m0s elapsed]%0Agoogle_vpc_access_connector.internal-vpc-connector: Creation complete after 2m9s [id=projects/gig-japan-398904/locations/asia-northeast1/connectors/vpc-connector]%0A%0AApply complete! Resources: 1 added, 1 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":41,"Program":"tfcmt","SHA1":"90198479c6108edab99d1a37a12ef9d012d1998b","Vars":{},"WorkflowName":"iaac_apply"} -->